Repository: grigoris-hmu/smart-plant-care
Catalog: SmartPlantCare/translations/*/LC_MESSAGES/messages.po
Languages: el

source: Please login to be able to view this page.
el: Παρακαλούμε κάντε σύνδεση για να μπορέσετε να δείτε αυτή τη σελίδα.

source: Click from more information
el: Κάντε κλικ για περισσότερες πληροφορίες

source: ERROR: Invalid coordinates format. Expecting a list of [latitude, longitude] pairs.
el: ΣΦΑΛΜΑ: Μη έγκυρη μορφή συντεταγμένων. Αναμένεται μια λίστα με ζεύγη [γεωγραφικό πλάτος, γεωγραφικό μήκος].

source: Error saving Crop Coordinates Data
el: Σφάλμα αποθήκευσης συντεταγμένων καλλιέργειας

source: Error handling Crop Coordinates Data
el: Σφάλμα χειρισμού συντεταγμένων καλλιέργειας

source: The crop <b>{name}</b> was successfully created
el: Η καλλιέργεια <b>{name}</b> δημιουργήθηκε επιτυχώς

source: Αdd new Crop
el: Εισαγωγή Νέας Καλλιέργειας

source: Exception: Invalid coordinates format. Expecting a list of [latitude, longitude] pairs.
el: Εξαίρεση: Συντεταγμένες: Μη έγκυρη μορφή συντεταγμένων. Αναμένεται μια λίστα ζευγών [γεωγραφικό πλάτος, γεωγραφικό μήκος]."

source: Error deleting Crop Coordinates Data
el: Σφάλμα διαγραφής δεδομένων συντεταγμένων καλλιέργειας

source: The crop was successfully edited
el: Η επεξεργασία της καλλιέργειας έγινε με επιτυχία

source: Edit Crop
el: Επεξεργασία Καλλιέργειας

source: The crop was successfully deleted.
el: Η καλλιέργεια διεγράφη με επιτυχία.

source: The crop was not found.
el: Η καλλιέργεια δεν βρέθηκε.

source: The size of the image cannot exceed {max_size} MB
el: Το μέγεθος του αρχείου εικόας δεν μπορεί να υπερβαίνει τα {max_size} MB

source: Crop Name
el: Όνομα Καλλιέργειας

source: This field cannot be empty.
el: Αυτό το πεδίο δε μπορεί να είναι κενό.

source: This field must be between {min} and {max} characters
el: Αυτό το πεδίο πρέπει να είναι από {min} έως {max} χαρακτήρες

source: Crop Location
el: Τοποθεσία Καλλιέργειας

source: Crop Prefecture
el: Νομός Καλλιέργειας

source: This field takes values from 1 to 99
el: Το πεδίο αυτό λαμβάνει τιμές από 1 έως 99

source: The area of the crop
el: Η περιοχή της Καλλιέργειας

source: The size of the crop
el: Η έκταση της Καλλιέργειας

source: This field takes values from 1 to 1000
el: Το πεδίο αυτό λαμβάνει τιμές από 1 έως 1000

source: The type of the crop
el: Το είδος της Καλλιέργειας

source: This field takes values from 1 to 9
el: Το πεδίο αυτό λαμβάνει τιμές από 1 έως 9

source: The soil type of the crop
el: Το είδος εδάφους της Καλλιέργειας

source: Crop map
el: Χάρτης Καλλιέργειας

source: Coordinates Type
el: Τύπος συντεταγμένων

source: This field must be {min} characters
el: Αρχείο Εικόνας

source: Only jpg, jpeg and png image files are allowed!
el: Επιτρέπονται μόνο αρχεία εικόνων jpg, jpeg και png!

source: Submit
el: Υποβολή

source: Location
el: Τοποθεσία

source: Size
el: Έκταση

source: Area
el: Περιοχή

source: Crop type
el: Είδος Καλλιέργειας

source: Soil type
el: Τύπος εδάφους Καλλιέργειας

source: Live Weather
el: Τρέχοντα δεδομένα καιρού

source: Temperature Graph
el: Διάγγραμα Θερμοκρασίας

source: Rain Graph
el: Διάγγραμα Βροχής

source: Irrigation graph
el: Διάγγραμα Άρδευσης

source: Sensors
el: Αισθητήρες

source: Possition
el: Τοποθεσία

source: Longtitute
el: Γεωγραφικό μήκος

source: Latitude
el: Γεωγραφικό πλάτος

source: Sensor Data
el: Δεδομένα αισθητήρων

source: Edit
el: Επεξεργασία

source: Delete
el: Διαγραφή

source: No crop found
el: Δε βρέθηκε καμμία καλλιέργεια

source: Delete crop
el: Διαγραφή καλλιέργειας

source: Are you sure you want to delete this crop?
el: Είστε σίγουρος/η ότι θέλετε να διαγράψετε αυτήν την καλλιέργεια;

source: Crops
el: Καλλιέργειες

source: Crops from all users
el: Καλλιέργειες από όλους τους χρήστες

source: Sorting by name
el: Ταξινόμηση βάσει ονόματος

source: Sorting by size
el: Ταξινόμηση βάσει έκτασης

source: Crops of the
el: Καλλιέργειες του

source: Crops by user
el: Καλλιέργειες απο το χρήστη

source: My Crops
el: Οι καλλιέργειες μου

source: Please enter the name of the crop.
el: Εισάγετε το όνομα της καλλιέργειας.

source: Please enter the location of the crop.
el: Εισάγετε την τοποθεσία της καλλιέργειας.

source: Prefecture
el: Νομός

source: Select prefecture
el: Επιλέξτε νομό

source: Please enter the prefecture of the crop.
el: Εισάγετε το νομό της καλλιέργειας.

source: Select area
el: Επιλέξτε περιοχή

source: Please enter the area of the crop.
el: Εισάγετε την περιοχή της καλλιέργειας.

source: Select Crop Type
el: Επιλέξτε είδος καλλιέργειας

source: Please enter the type of the crop.
el: Εισάγετε το είδος της καλλιέργειας.

source: Select Soil Type
el: Επιλέξτε είδος εδάφους

source: Please enter the soil type of the crop.
el: Εισάγετε το είδος εδάφους της καλλιέργειας.

source: Please enter the size of the crop.
el: Εισάγετε το μέγεθος (έκταση) της καλλιέργειας.

source: Please enter the coordinates of the crop.
el: Εισάγετε τις συντεταγμένες της καλλιέργειας.

source: Select Coordinates Type
el: Εισάγετε τις συντεταγμένες της καλλιέργειας.

source: EGSA87
el: ΕΓΣΑ87

source: Please enter the Coordinates type
el: Εισάγετε τον τύπο των συντεταγμένων

source: Please provide a picture of the crop.
el: Παρακαλώ δώστε μία εικόνα για την καλλιέργεια.

source: Select Prefecture...
el: Επιλέξτε Νομό...

source: Select area...
el: Επιλέξτε περιοχή...

source: No CSV file part
el: Δεν υπάρχει μέρος αρχείου CSV

source: No file uploaded
el: Δεν έχει μεταφορτωθεί αρχείο

source: Only CSV files are allowed
el: Επιτρέπονται μόνο αρχεία CSV

source: Bulletin data added (Date: from {start_date} to {end_date})
el: Προστέθηκαν τα δεδομένα Δελτίου (Ημερομηνία: από {start_date} έως {end_date})

source: Irrigation
el: Άρδευση

source: Date
el: Ημερομηνία

source: Irrigation Needs (κ.μ./στρ.)
el: Ανάγκες Άρδευσης (κ.μ./στρ.)

source: Irrigation Needs
el: Ανάγκες Άρδευσης

source: Irrigation Dose
el: Δόση Άρδευσης

source: Readings Graph Start Date
el: Διάγραμμα Άρδευσης Ημερομηνία Έναρξης

source: Readings Graph End Date
el: Διάγραμμα Άρδευσης Ημερομηνία Λήξης

source: Bulletin Start Date
el: Ημερομηνία Έναρξης Δελτίου

source: Bulletin End Date
el: Ημερομηνία Λήξης Δελτίου

source: CSV file
el: Αρχείο CSV

source: Only CSV files are allowed!
el: Επιτρέπονται μόνο αρχεία CSV!

source: Readings Graph
el: Διάγραμμα Άρδευσης

source: New Region Bulletin
el: Νέο Δελτίο Άρδευσης

source: Readings graph
el: Διάγραμμα Άρδευσης

source: Please enter the start date (first day)
el: Εισάγετε την ημερομηνία έναρξης (πρώτη ημέρα)

source: Please enter the end date (last day)
el: Εισάγετε την ημερομηνία λήξης (τελευταία ημέρα)

source: Please provide a bulletin CSV file.
el: Παρακαλούμε δώστε ένα αρχείο δελτίου CSV.

source: Home Page
el: Αρχική Σελίδα

source: Position
el: Τοποθεσία

source: Longitude
el: Γεωγραφικό μήκος

source: Sensor Value
el: Τιμή αισθητήρα

source: ERROR 404! The page you requested could not be found!
el: ERROR 404! Η σελίδα που ζητήσατε δεν βρέθηκε!

source: ERROR 415! The image type you provided is not supported by our server!
el: ERROR 415! Το αρχείο εικόνας που δώσατε δεν υποστηρίζεται από τον εξυπηρετητή μας!

source: ERROR 500! Internal Server Error!
el: ERROR 500! Εσωτερικό Σφάλμα Εξυπηρετητή!

source: Welcome
el: Καλώς ήλθατε

source: My crops
el: Οι καλλιέργειές μου

source: New Crop
el: Νέα Καλλιέργεια

source: New Bulletin
el: Νέο Δελτίο

source: Logout
el: Αποσύνδεση

source: Signup
el: Εγγραφή

source: Login
el: Είσοδος

source: The account for user <b>{username}</b> was created successfully.
el: Ο λογαρισμός του χρήστη <b>{username}</b> δημιουργήθηκε με επιτυχία

source: The account of the user <b>{username}</b> was updated successfully.
el: Ο λογαρισμός του χρήστη <b>{username}</b> τροποποιήθηκε με επιτυχία

source: The login of the user with email: {email} to our website was successful.
el: Η είσοδος του χρήστη με email: {email} στη σελίδα μας έγινε με επιτυχία.

source: The user has been logged out.
el: Ο χρήστης αποσυνδέθηκε.

source: This email already exists!
el: Αυτό το email υπάρχει ήδη!

source: Invalid phone number.
el: Μη έγκυρος αριθμός τηλεφώνου.

source: This field must be between 3 and 15 characters
el: Αυτό το πεδίο πρέπει να είναι από 3 έως 15 χαρακτήρες

source: Please enter a valid email address
el: Παρακαλώ εισάγετε μια σωστή διεύθυνση email

source: Mobile (+30)
el: Κινητό (+30)

source: This field must be 10 characters
el: Αυτό το πεδίο πρέπει να είναι 10 χαρακτήρες

source: Crop image
el: Αρχείο εικόνας Καλλιέργειας

source: This username already exists!
el: Αυτό το username υπάρχει ήδη!

source: Remember me
el: Να με θυμάσαι

source: Confirm password
el: Επιβεβαίωση password

source: The two password fields must be the same
el: Τα δύο πεδία password πρέπει να είναι τα ίδια

source: Account Update
el: Τροποποίηση Λογαριασμού

source: Account Update Form
el: Φόρμα Τροποποίησης Λογαριασμού

source: Please enter your username.
el: Παρακαλούμε εισάγετε το όνομα χρήστη σας.

source: Please enter your email.
el: Παρακαλούμε εισάγετε το email σας.

source: Please enter your mobile phone number.
el: Παρακαλούμε εισάγετε τον αριθμό του κινητού σας τηλεφώνου.

source: Please enter your your profile image.
el: Παρακαλούμε εισάγετε την εικόνα προφίλ σας.

source: Please enter your password.
el: Παρακαλούμε εισάγετε τον κωδικό σας.

source: Signup Form
el: Φόρμα Εγγραφής

source: Please enter your password again for validation.
el: Παρακαλούμε εισάγετε ξανά τον κωδικό σας για επιβεβαίωση.

source: Rain Data
el: Δεδομένα Βροχής

source: Weather Data
el: Δεδομένα Καιρού

source: Live Weather Data
el: Τρέχοντα Δεδομένα Καιρού
